# Analysis of US Federal Election Data

### ---------------DATA LOAD------------------

#### We decide to wrangling our data before we normalize our dataset into tables. We have checked our data and found many unreasonable spots such as Null value, ridiculou large age, useless columns and unreasonable age range. We used Trifacta to wrangle our data. Following is our recipe:

##### 1. Rename the columns.
Note that we need to add header on before we do our project.
##### 2. Delete the columns we don't need and includes too many NA or blank value in it. 
there is too many NA and missing value, we do not need that because that's not useful information. 
##### 3. Join the dateset with candidate master and all_cand by cand_id, with committee master by cmte_id and then add more colunms we need and integrate into the final dataset we need.
We need to join our dataset in to one final dataset in order for better analyze. 
##### 4. delte some of mismatching value in the column.
this is because some mismatch value will contain a mismatch problem with our dataset.
##### 5. We decide to delete all the transaction is null value because that's not useful information. 
some transaction is null is not usfulful when we want to analyze the total transaction
we do not need the value which is not match into ourdaset.
##### 6. when we clean the data, we find the most large debt from trump is delete by mistake, so we add a value 11339279.2 from trump at column debts_owned_by. 
some value is missing because mismatch prime key, so delete some useful value, so we decide to add on this useful information.
##### 7. run our final dataset into csv file and upload into our bucker so we can acess wget from the bucket.

In [1]:
!wget https://final6212.s3.amazonaws.com/all1_new.csv

--2020-12-08 16:46:27--  https://final6212.s3.amazonaws.com/all1_new.csv
Resolving final6212.s3.amazonaws.com (final6212.s3.amazonaws.com)... 52.217.78.252
Connecting to final6212.s3.amazonaws.com (final6212.s3.amazonaws.com)|52.217.78.252|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 45193900 (43M) [text/csv]
Saving to: ‘all1_new.csv’

all1_new.csv        100%[===================>]  43.10M  83.4MB/s    in 0.5s

2020-12-08 16:46:28 (83.4 MB/s) - ‘all1_new.csv’ saved [45193900/45193900]

In [2]:
!wc -l all1_new.csv

173886 all1_new.csv

In [3]:
!head -n 10000 all1_new.csv | csvstat

  1. "CMTE_ID"

	Type of data:          Text
	Contains null values:  False
	Unique values:         1124
	Longest value:         9 characters
	Most common values:    C00000935 (162x)
	                       C00238725 (153x)
	                       C00030718 (113x)
	                       C00732172 (108x)
	                       C00303024 (107x)

  2. "CMTE_NM"

	Type of data:          Text
	Contains null values:  False
	Unique values:         1123
	Longest value:         174 characters
	Most common values:    DCCC (162x)
	                       NATIONAL AIR TRAFFIC CONTROLLERS ASSOCIATION PAC (153x)
	                       NATIONAL ASSOCIATION OF REALTORS POLITICAL ACTION COMMITTEE (113x)
	                       SAVE AMERICA FUND (108x)
	                       LOCKHEED MARTIN CORPORATION EMPLOYEES' POLITICAL ACTION COMMITTEE (107x)

  3. "CMTE_CITY"

	Type of data:          Text
	Contains null values:  False
	Unique values:         326
	Longest value:         20 characters
	Most common values:    WASHINGTON (4548x)
	                       ARLINGTON (432x)
	                       ALEXANDRIA (423x)
	                       CHICAGO (222x)
	                       DALLAS (156x)

  4. "CMTE_ST"

	Type of data:          Text
	Contains null values:  False
	Unique values:         44
	Longest value:         2 characters
	Most common values:    DC (4568x)
	                       VA (1338x)
	                       TX (570x)
	                       IL (436x)
	                       CA (359x)

  5. "CMTE_DSGN"

	Type of data:          Text
	Contains null values:  False
	Unique values:         5
	Longest value:         1 characters
	Most common values:    B (7631x)
	                       U (2040x)
	                       D (186x)
	                       P (141x)
	                       A (1x)

  6. "ORG_TP"

	Type of data:          Text
	Contains null values:  True (excluded from calculations)
	Unique values:         7
	Longest value:         1 characters
	Most common values:    C (3918x)
	                       T (2118x)
	                       M (1433x)
	                       None (1167x)
	                       L (1051x)

  7. "CAND_ID"

	Type of data:          Text
	Contains null values:  False
	Unique values:         89
	Longest value:         9 characters
	Most common values:    S4IA00129 (819x)
	                       H6FL07140 (683x)
	                       S4SD00049 (522x)
	                       H8WI01156 (463x)
	                       H6TX15162 (379x)

  8. "ENTITY_TP"

	Type of data:          Text
	Contains null values:  True (excluded from calculations)
	Unique values:         8
	Longest value:         3 characters
	Most common values:    CCM (8956x)
	                       ORG (594x)
	                       CAN (175x)
	                       PAC (66x)
	                       None (59x)

  9. "NAME"

	Type of data:          Text
	Contains null values:  True (excluded from calculations)
	Unique values:         435
	Longest value:         77 characters
	Most common values:    JONI FOR IOWA (665x)
	                       STEPHANIE MURPHY FOR CONGRESS (663x)
	                       ROUNDS FOR SENATE (508x)
	                       STEIL FOR WISCONSIN, INC. (397x)
	                       VICENTE GONZALEZ FOR CONGRESS (368x)

 10. "TRANSACTION_DT"

	Type of data:          Number
	Contains null values:  True (excluded from calculations)
	Unique values:         538
	Smallest value:        1012019
	Largest value:         12312019
	Sum:                   64938147952
	Mean:                  6508785.000702
	Median:                6242020
	StDev:                 3043023.976079
	Most common values:    6252019 (101x)
	                       9242020 (75x)
	                       9252019 (75x)
	                       9232019 (73x)
	                       6242019 (71x)

 11. "TRANSACTION_AMT"

	Type of data:          Number
	Contains null values:  False
	Unique values:         561
	Smallest value:        -5000
	Largest value:         3201973
	Sum:                   57353692
	Mean:                  5735.942794
	Median:                1500
	StDev:                 67550.205478
	Most common values:    1000 (3855x)
	                       2500 (1888x)
	                       5000 (1023x)
	                       2000 (812x)
	                       1500 (673x)

 12. "CAND_NAME"

	Type of data:          Text
	Contains null values:  False
	Unique values:         89
	Longest value:         26 characters
	Most common values:    ERNST, JONI K (819x)
	                       MURPHY, STEPHANIE (683x)
	                       ROUNDS, MIKE (522x)
	                       STEIL, BRYAN GEORGE (463x)
	                       GONZALEZ, VICENTE (379x)

 13. "CAND_PTY_AFFILIATION"

	Type of data:          Text
	Contains null values:  False
	Unique values:         3
	Longest value:         3 characters
	Most common values:    REP (5702x)
	                       DEM (4278x)
	                       IND (19x)

 14. "TTL_RECEIPTS"

	Type of data:          Number
	Contains null values:  False
	Unique values:         88
	Smallest value:        -246174.33
	Largest value:         90026046.63
	Sum:                   67946190269.97
	Mean:                  6795298.556853
	Median:                2096789.8
	StDev:                 13386767.844542
	Most common values:    27544836.47 (819x)
	                       3144614.17 (683x)
	                       3657142.64 (522x)
	                       3246893.1 (463x)
	                       1257381.45 (379x)

 15. "COH_BOP"

	Type of data:          Number
	Contains null values:  False
	Unique values:         55
	Smallest value:        0
	Largest value:         6483856.47
	Sum:                   4683147227.63
	Mean:                  468361.558919
	Median:                149372.42
	StDev:                 631416.89922
	Most common values:    0 (861x)
	                       1363149.69 (819x)
	                       85873.33 (683x)
	                       511538.45 (522x)
	                       26355.7 (463x)

 16. "COH_COP"

	Type of data:          Number
	Contains null values:  False
	Unique values:         76
	Smallest value:        -29113.16
	Largest value:         14751939.27
	Sum:                   13025801019.54
	Mean:                  1302710.372991
	Median:                722596.7
	StDev:                 2344845.065068
	Most common values:    855405.54 (819x)
	                       1442379.85 (683x)
	                       1811012.16 (522x)
	                       514289.35 (463x)
	                       1423300.75 (379x)

 17. "CAND_LOANS"

	Type of data:          Number
	Contains null values:  False
	Unique values:         26
	Smallest value:        0
	Largest value:         2227431
	Sum:                   257197793.11
	Mean:                  25722.351546
	Median:                0
	StDev:                 131516.315385
	Most common values:    0 (9182x)
	                       288942.05 (308x)
	                       250000 (171x)
	                       285000 (120x)
	                       100000 (64x)

 18. "OTHER_LOANS"

	Type of data:          Number
	Contains null values:  False
	Unique values:         4
	Smallest value:        0
	Largest value:         25000
	Sum:                   720100
	Mean:                  72.017202
	Median:                0
	StDev:                 990.056101
	Most common values:    0 (9911x)
	                       5600 (75x)
	                       25000 (12x)
	                       100 (1x)

 19. "CAND_LOAN_REPAY"

	Type of data:          Number
	Contains null values:  False
	Unique values:         21
	Smallest value:        0
	Largest value:         935000
	Sum:                   335451769.26
	Mean:                  33548.531779
	Median:                0
	StDev:                 94268.365362
	Most common values:    0 (8319x)
	                       250000 (550x)
	                       25000 (330x)
	                       385100 (308x)
	                       76000 (281x)

 20. "OTHER_LOAN_REPAY"

	Type of data:          Number
	Contains null values:  False
	Unique values:         4
	Smallest value:        0
	Largest value:         15000
	Sum:                   185700
	Mean:                  18.571857
	Median:                0
	StDev:                 522.347289
	Most common values:    0 (9985x)
	                       15000 (12x)
	                       100 (1x)
	                       5600 (1x)

 21. "DEBTS_OWED_BY"

	Type of data:          Number
	Contains null values:  False
	Unique values:         30
	Smallest value:        0
	Largest value:         2440875.39
	Sum:                   542452756.6
	Mean:                  54250.70073
	Median:                0
	StDev:                 148668.687533
	Most common values:    0 (6594x)
	                       89437.99 (522x)
	                       250000 (387x)
	                       247800 (330x)
	                       387842.05 (308x)

 22. "TOTAL_LIABILITIES"

	Type of data:          Number
	Contains null values:  False
	Unique values:         43
	Smallest value:        0
	Largest value:         4668306.39
	Sum:                   800370649.71
	Mean:                  80045.069478
	Median:                0
	StDev:                 260846.002739
	Most common values:    0 (6241x)
	                       250000 (550x)
	                       89437.99 (522x)
	                       247800 (330x)
	                       676784.1 (308x)

 23. "TTL_INDIV_CONTRIB"

	Type of data:          Number
	Contains null values:  False
	Unique values:         82
	Smallest value:        0
	Largest value:         87931707.58
	Sum:                   53582124037.72
	Mean:                  5358748.2786
	Median:                1246681.68
	StDev:                 12637590.014317
	Most common values:    21696975.95 (819x)
	                       1246681.68 (683x)
	                       2062116.23 (522x)
	                       1843739.3 (463x)
	                       192433.25 (379x)

 24. "OTHER_POL_CMTE_CONTRIB"

	Type of data:          Number
	Contains null values:  False
	Unique values:         73
	Smallest value:        0
	Largest value:         2721658.53
	Sum:                   9622210804.8
	Mean:                  962317.312211
	Median:                848187.14
	StDev:                 697325.948455
	Most common values:    2721658.53 (819x)
	                       1765639.38 (683x)
	                       1490350 (522x)
	                       1161510.5 (463x)
	                       991559 (379x)

 25. "POL_PTY_CONTRIB"

	Type of data:          Number
	Contains null values:  False
	Unique values:         24
	Smallest value:        0
	Largest value:         915000
	Sum:                   80452626.19
	Mean:                  8046.067226
	Median:                53.5
	StDev:                 29495.731452
	Most common values:    0 (4592x)
	                       45850 (819x)
	                       2500 (684x)
	                       53.5 (463x)
	                       6088.4 (379x)

 26. "INDIV_REFUNDS"

	Type of data:          Number
	Contains null values:  False
	Unique values:         63
	Smallest value:        -5400
	Largest value:         695661.71
	Sum:                   411079410.72
	Mean:                  41112.052277
	Median:                8561.05
	StDev:                 97479.916087
	Most common values:    0 (1308x)
	                       98505.63 (819x)
	                       8561.05 (683x)
	                       35650 (522x)
	                       500 (467x)

 27. "CMTE_REFUNDS"

	Type of data:          Number
	Contains null values:  False
	Unique values:         33
	Smallest value:        -20400
	Largest value:         69300
	Sum:                   68689205.99
	Mean:                  6869.60756
	Median:                3800
	StDev:                 11597.055256
	Most common values:    0 (3190x)
	                       16500 (819x)
	                       7500 (738x)
	                       5686.63 (683x)
	                       5400 (522x)

 28. "CAND_ELECTION_YR"

	Type of data:          Number
	Contains null values:  False
	Unique values:         7
	Smallest value:        2014
	Largest value:         2024
	Sum:                   20199434
	Mean:                  2020.145415
	Median:                2020
	StDev:                 0.745498
	Most common values:    2020 (9462x)
	                       2024 (305x)
	                       2022 (169x)
	                       2018 (33x)
	                       2019 (28x)

 29. "CAND_OFFICE_ST"

	Type of data:          Text
	Contains null values:  False
	Unique values:         35
	Longest value:         2 characters
	Most common values:    TX (1725x)
	                       CA (1448x)
	                       FL (886x)
	                       IA (880x)
	                       NJ (544x)

 30. "CAND_OFFICE"

	Type of data:          Text
	Contains null values:  False
	Unique values:         2
	Longest value:         1 characters
	Most common values:    H (7715x)
	                       S (2284x)

 31. "CAND_OFFICE_DISTRICT"

	Type of data:          Number
	Contains null values:  False
	Unique values:         27
	Smallest value:        0
	Largest value:         45
	Sum:                   86049
	Mean:                  8.605761
	Median:                5
	StDev:                 11.034634
	Most common values:    0 (2400x)
	                       7 (1022x)
	                       1 (925x)
	                       2 (835x)
	                       4 (733x)

 32. "CAND_PCC"

	Type of data:          Text
	Contains null values:  False
	Unique values:         89
	Longest value:         9 characters
	Most common values:    C00546788 (819x)
	                       C00620443 (683x)
	                       C00532465 (522x)
	                       C00677286 (463x)
	                       C00592659 (379x)

Row count: 9999

In [79]:
!csvcut -n all1_new.csv

  1: CMTE_ID
  2: CMTE_NM
  3: CMTE_CITY
  4: CMTE_ST
  5: CMTE_DSGN
  6: ORG_TP
  7: CAND_ID
  8: ENTITY_TP
  9: NAME
 10: TRANSACTION_DT
 11: TRANSACTION_AMT
 12: CAND_NAME
 13: CAND_PTY_AFFILIATION
 14: TTL_RECEIPTS
 15: COH_BOP
 16: COH_COP
 17: CAND_LOANS
 18: OTHER_LOANS
 19: CAND_LOAN_REPAY
 20: OTHER_LOAN_REPAY
 21: DEBTS_OWED_BY
 22: TOTAL_LIABILITIES
 23: TTL_INDIV_CONTRIB
 24: OTHER_POL_CMTE_CONTRIB
 25: POL_PTY_CONTRIB
 26: INDIV_REFUNDS
 27: CMTE_REFUNDS
 28: CAND_ELECTION_YR
 29: CAND_OFFICE_ST
 30: CAND_OFFICE
 31: CAND_OFFICE_DISTRICT
 32: CAND_PCC

## --------------Schema (Dimensional Model)-----------------

In [136]:
from IPython.display import Image

In [134]:
Image(url="https://final6212.s3.amazonaws.com/schema.png")

## ---------------SQL tables-----------------

* let create a big table with all the attribute we need from file we updated into the bucket.

In [2]:
!dropdb -U student final

In [3]:
!createdb -U student final

In [4]:
%load_ext sql

In [5]:
%sql postgresql://student@/final

In [80]:
%%sql
DROP TABLE IF EXISTS election2020 cascade;

CREATE TABLE election2020 (
CMTE_ID varchar(9) NOT NULL,
CMTE_NM VARCHAR(200) NULL,
CMTE_CITY VARCHAR(30) NULL,
CMTE_ST VARCHAR(2) NULL,
CMTE_DSGN VARCHAR(1) NULL,
ORG_TP VARCHAR(1) NULL,
CAND_ID VARCHAR(9) NOT NULL,
ENTITY_TP VARCHAR (3) NULL,
CONT_NAME VARCHAR (200) NULL,
TRANSACTION_DT VARCHAR(10) NULL,
TRANSACTION_AMT NUMERIC(30) NULL,
CAND_NAME VARCHAR(200) NULL,
CAND_PTY_AFFILIATION VARCHAR(3) NULL,
TTL_RECEIPTS NUMERIC(14,2) NULL,
COH_BOP NUMERIC(14,2) NULL,
COH_COP NUMERIC(14,2) NULL,
CAND_LOANS NUMERIC(14,2) NULL,
OTHER_LOANS NUMERIC(14,2) NULL,
CAND_LOAN_REPAY NUMERIC(14,2) NULL,
OTHER_LOAN_REPAY NUMERIC(14,2) NULL,
DEBTS_OWED_BY NUMERIC(14,2) NULL,
TOTAL_LIABILITIES NUMERIC(14,2) NULL,
TTL_INDIV_CONTRIB NUMERIC(14,2) NULL, 
OTHER_POL_CMTE_CONTRIB  NUMERIC(14,2) NULL,
POL_PTY_CONTRIB NUMERIC(14,2) NULL, 
INDIV_REFUNDS NUMERIC(14,2) NULL,
CMTE_REFUNDS NUMERIC(14,2) NULL, 
CAND_ELECTION_YR varchar(4) NULL,
CAND_OFFICE_ST VARCHAR(2) NULL,
CAND_OFFICE VARCHAR(1) NULL,
CAND_OFFICE_DISTRICT VARCHAR(2),
CAND_PCC VARCHAR(9) NULL
)

 * postgresql://student@/final
Done.
Done.

[]

* Insert the prepared data into the table

In [81]:
%%sql
copy election2020
from '/home/ubuntu/all1_new.csv'
CSV
HEADER;

 * postgresql://student@/final
173885 rows affected.

[]

In [82]:
%%sql
SELECT * 
FROM election2020
LIMIT 3

 * postgresql://student@/final
3 rows affected.

[('C00379628', 'NUCOR CORPORATION POLITICAL ACTION COMMITTEE', 'CHARLOTTE', 'NC', 'U', 'C', 'H0AL05163', 'CCM', 'MO BROOKS FOR CONGRESS', '3272019', Decimal('2500'), 'BROOKS, MO', 'REP', Decimal('634450.11'), Decimal('692181.51'), Decimal('1114335.09'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('382816.54'), Decimal('250020.00'), Decimal('0.00'), Decimal('8000.00'), Decimal('0.00'), '2020', 'AL', 'H', '5', 'C00464149'),
 ('C00365502', 'BWX TECHNOLOGIES, INC POLITICAL ACTION COMMITTEE', 'LYNCHBURG', 'VA', 'B', 'C', 'H0AL05163', 'CCM', 'MOBROOKSFORCONGRESS.COM', '4162019', Decimal('1000'), 'BROOKS, MO', 'REP', Decimal('634450.11'), Decimal('692181.51'), Decimal('1114335.09'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('382816.54'), Decimal('250020.00'), Decimal('0.00'), Decimal('8000.00'), Decimal('0.00'), '2020', 'AL', 'H', '5', 'C00464149'),
 ('C00300418', 'SCIENCE APPLICATIONS INTERNATIONAL CORPORATION VOLUNTARY POLITICAL ACTION COMMITTEE', 'RESTON', 'VA', 'B', 'C', 'H0AL05163', 'CCM', 'MO BROOKS FOR CONGRESS', '4182019', Decimal('1000'), 'BROOKS, MO', 'REP', Decimal('634450.11'), Decimal('692181.51'), Decimal('1114335.09'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('382816.54'), Decimal('250020.00'), Decimal('0.00'), Decimal('8000.00'), Decimal('0.00'), '2020', 'AL', 'H', '5', 'C00464149')]

* The number of the distinct state in the table is over 50

In [83]:
%%sql
SELECT COUNT(DISTINCT cmte_st)
FROM election2020

 * postgresql://student@/final
1 rows affected.

[(51,)]

* Change the data not matched to the 50 states and "DC" of the US to NULL value

In [84]:
%%sql

DELETE FROM election2020
WHERE UPPER(cmte_st) NOT IN ('AK', 'AL', 'AR','AZ','CA','CO','CT','DE','DC','FL','GA','HI','IA','ID','IL','IN','KS',
                           'KY','LA','MA','MD','ME','MI','MN','MO','MS','MT','NC','ND','NE','NH','NJ','NM',
                           'NV','NY','OH','OK','OR','PA','RI','SC','SD','TN','TX','UT','VA','VT','WA','WI','WV','WY');

 * postgresql://student@/final
0 rows affected.

[]

* The distinct state data has decreased to 51 (including DC)

In [85]:
%%sql
SELECT COUNT(DISTINCT cmte_st)
FROM election2020

 * postgresql://student@/final
1 rows affected.

[(51,)]

## ------------------DIMENSION/FACT TABLES--------------------

### DATE dimension

In [86]:
%%sql
DROP TABLE IF EXISTS date;

CREATE TABLE date (
    key SERIAL PRIMARY KEY,
    full_date VARCHAR(8),
    day VARCHAR(2),
    month VARCHAR(2),
    year VARCHAR(4)
);

 * postgresql://student@/final
Done.
Done.

[]

In [87]:
%%sql
INSERT INTO date(full_date, day, month, year)
SELECT DISTINCT transaction_dt,
SUBSTRING(transaction_dt,3,2),
SUBSTRING(transaction_dt,1,2),
SUBSTRING(transaction_dt,5,4) 
FROM election2020;

 * postgresql://student@/final
697 rows affected.

[]

In [88]:
%%sql
SELECT * 
FROM date
limit 5

 * postgresql://student@/final
5 rows affected.

[(1, '10302019', '30', '10', '2019'),
 (2, '7182020', '82', '71', '020'),
 (3, None, None, None, None),
 (4, '10272020', '27', '10', '2020'),
 (5, '8262020', '62', '82', '020')]

### Location Dimension

In [89]:
%%sql
DROP TABLE IF EXISTS location;

CREATE TABLE location (
    key SERIAL PRIMARY KEY,
    cmte_city VARCHAR(30),
    cmte_state VARCHAR(2),
    cand_office_st VARCHAR(2) NULL
);

 * postgresql://student@/final
Done.
Done.

[]

In [90]:
%%sql
INSERT INTO location(cmte_city, cmte_state,CAND_OFFICE_ST)
SELECT DISTINCT cmte_city, 
cmte_st,
cand_office_st
FROM election2020;

 * postgresql://student@/final
9685 rows affected.

[]

In [91]:
%%sql
SELECT * 
FROM location
limit 5;

 * postgresql://student@/final
5 rows affected.

[(1, 'JACKSON', 'MI', 'WA'),
 (2, 'ATLANTIC BEACH', 'FL', 'OK'),
 (3, 'HOUSTON', 'TX', 'GA'),
 (4, 'FAIRFAX', 'VA', 'OR'),
 (5, 'MORRISTOWN', 'NJ', 'NC')]

### Committee Dimension

In [92]:
%%sql
DROP TABLE IF EXISTS committee;

CREATE TABLE committee (
    key SERIAL PRIMARY KEY,
    cmte_id VARCHAR(9),
    cmte_name VARCHAR(200),
    contributor_name VARCHAR(200),
    cmte_dsgn VARCHAR(2),
    entity_type VARCHAR(3),
    org_tp VARCHAR(1) NULL
);

 * postgresql://student@/final
Done.
Done.

[]

In [93]:
%%sql
INSERT INTO committee(cmte_id, cmte_name, contributor_name, cmte_dsgn, entity_type,org_tp)
SELECT DISTINCT cmte_id, 
cmte_nm, 
cont_name, 
cmte_dsgn, 
entity_tp,
org_tp
FROM election2020;

 * postgresql://student@/final
85474 rows affected.

[]

In [94]:
%%sql
SELECT * 
FROM committee
limit 5;

 * postgresql://student@/final
5 rows affected.

[(1, 'C00034355', 'PEOPLE PAC (PACCAR INC EMPLOYEES ORGANIZED FOR POLITICAL LEADERSHIP AND EDUCATION PAC)', 'JAIME FOR CONGRESS', 'U', 'CCM', 'C'),
 (2, 'C00357129', 'AMERICAN ASSOCIATION FOR HOMECARE POLITICAL ACTION COMMITTEE (AAHOMECARE PAC)', 'TOM REED FOR CONGRESS', 'B', 'CCM', 'T'),
 (3, 'C00300921', "BLACK AMERICA'S POLITICAL ACTION COMMITTEE", 'HAMILTON, TAMIKA', 'U', 'CAN', None),
 (4, 'C00089136', 'ALTRIA GROUP, INC. POLITICAL ACTION COMMITTEE (ALTRIAPAC)', 'VOLUNTEERS FOR SHIMKUS', 'B', 'CCM', 'C'),
 (5, 'C00000729', 'AMERICAN DENTAL ASSOCIATION POLITICAL ACTION COMMITTEE', 'SHANE HERNANDEZ FOR CONGRESS', 'B', 'CCM', 'M')]

### Candidiate Dimension

In [95]:
%%sql
DROP TABLE IF EXISTS candidate;

CREATE TABLE candidate (
    key SERIAL PRIMARY KEY,
    cand_id VARCHAR(9),
    cand_name VARCHAR(50),
    cand_party VARCHAR(3),
    total_receipts NUMERIC(14,2),
    CAND_ELECTION_YR varchar(4) NULL,
    CAND_OFFICE VARCHAR(1) NULL,
    CAND_OFFICE_DISTRICT VARCHAR(2),
    CAND_PCC VARCHAR(9) NULL,
    CAND_PTY_AFFILIATION VARCHAR(3) NULL
    
);

 * postgresql://student@/final
Done.
Done.

[]

In [96]:
%%sql
INSERT INTO candidate(cand_id, cand_name, cand_party, total_receipts,CAND_ELECTION_YR,CAND_OFFICE,CAND_OFFICE_DISTRICT,CAND_PCC,CAND_PTY_AFFILIATION)
SELECT DISTINCT cand_id, 
cand_name, 
cand_pty_affiliation, 
ttl_receipts,
CAND_ELECTION_YR,
CAND_OFFICE,
CAND_OFFICE_DISTRICT,
CAND_PCC,
CAND_PTY_AFFILIATION
FROM election2020;

 * postgresql://student@/final
1391 rows affected.

[]

In [97]:
%%sql
SELECT * 
FROM candidate
limit 5;

 * postgresql://student@/final
5 rows affected.

[(1, 'S8ID00092', 'RISCH, JAMES E', 'REP', Decimal('2936679.42'), '2020', 'S', '0', 'C00440362', 'REP'),
 (2, 'H0GA14089', 'BARGE, JOHN D', 'REP', Decimal('180726.00'), '2020', 'H', '14', 'C00736959', 'REP'),
 (3, 'H0FL03159', 'WELLS, AMY POPE', 'REP', Decimal('220476.92'), '2020', 'H', '3', 'C00703520', 'REP'),
 (4, 'H0MD01216', 'DELGADO, JORGE', 'REP', Decimal('108337.73'), '2020', 'H', '1', 'C00719658', 'REP'),
 (5, 'S2VA00142', 'KAINE, TIMOTHY MICHAEL', 'DEM', Decimal('1183495.96'), '2024', 'S', '0', 'C00495358', 'DEM')]

## distribution dimensional table

In [98]:
%%sql
DROP TABLE IF EXISTS distributed cascade;

CREATE TABLE distributed (
    key SERIAL PRIMARY KEY,
    COH_BOP  NUMERIC(14,2) NULL,
    COH_COP NUMERIC(14,2) NULL
);

 * postgresql://student@/final
Done.
Done.

[]

In [99]:
%%sql
INSERT INTO distributed(COH_BOP,COH_COP)
SELECT DISTINCT COH_BOP, COH_COP
FROM election2020;

 * postgresql://student@/final
1248 rows affected.

[]

In [100]:
%%sql
SELECT * 
FROM distributed
limit 5;

 * postgresql://student@/final
5 rows affected.

[(1, Decimal('0.00'), Decimal('0.00')),
 (2, Decimal('109801.51'), Decimal('248710.25')),
 (3, Decimal('0.00'), Decimal('-711.84')),
 (4, Decimal('0.00'), Decimal('113.58')),
 (5, Decimal('1053294.45'), Decimal('1371021.71'))]

### loan & refund dimensional table

In [101]:
%%sql
DROP TABLE IF EXISTS loan_refund cascade;

CREATE TABLE loan_refund (
    key SERIAL PRIMARY KEY,
    CAND_LOANS NUMERIC(14,2) NULL,
    OTHER_LOANS NUMERIC(14,2) NULL,
    CAND_LOAN_REPAY NUMERIC(14,2) NULL,
    OTHER_LOAN_REPAY NUMERIC(14,2) NULL,
    DEBTS_OWED_BY NUMERIC(14,2) NULL
);

 * postgresql://student@/final
Done.
Done.

[]

In [102]:
%%sql
INSERT INTO loan_refund(CAND_LOANS,OTHER_LOANS,CAND_LOAN_REPAY,OTHER_LOAN_REPAY,DEBTS_OWED_BY)
SELECT DISTINCT CAND_LOANS,
OTHER_LOANS,
CAND_LOAN_REPAY,
OTHER_LOAN_REPAY,
DEBTS_OWED_BY
FROM election2020;

 * postgresql://student@/final
590 rows affected.

[]

In [103]:
%%sql
SELECT * 
FROM loan_refund
limit 5;

 * postgresql://student@/final
5 rows affected.

[(1, Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('3191.43')),
 (2, Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('315000.00')),
 (3, Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('10200.00')),
 (4, Decimal('2100.00'), Decimal('100.00'), Decimal('2100.00'), Decimal('100.00'), Decimal('0.00')),
 (5, Decimal('25000.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('34231.18'))]

### Add the four dimension key columns with the corresponding foreign key constraints to the fact table

#### * date_key

In [104]:
%%sql
ALTER TABLE election2020
ADD COLUMN date_key INTEGER,
ADD CONSTRAINT dt_fk FOREIGN KEY(date_key) REFERENCES date(key);

 * postgresql://student@/final
Done.

[]

In [105]:
%%sql
UPDATE election2020
SET date_key = date.key
FROM date
WHERE election2020.transaction_dt = date.full_date

 * postgresql://student@/final
173411 rows affected.

[]

* drop the full_date column which was used only to connect the fact table and the corresponding dimension table

In [106]:
%%sql
ALTER TABLE date
DROP COLUMN full_date;

 * postgresql://student@/final
Done.

[]

#### * location_key

In [107]:
%%sql
ALTER TABLE election2020
ADD COLUMN location_key INTEGER,
ADD CONSTRAINT lc_fk FOREIGN KEY(location_key) REFERENCES location(key);

 * postgresql://student@/final
Done.

[]

In [108]:
%%sql
UPDATE election2020
SET location_key = location.key
FROM location
WHERE election2020.cmte_city = location.cmte_city AND election2020.cmte_st = location.cmte_state AND election2020.CAND_OFFICE_ST=location.CAND_OFFICE_ST;

 * postgresql://student@/final
173830 rows affected.

[]

#### * committee_key

In [109]:
%%sql
ALTER TABLE election2020
ADD COLUMN committee_key INTEGER,
ADD CONSTRAINT cm_fk FOREIGN KEY(committee_key) REFERENCES committee(key);

 * postgresql://student@/final
Done.

[]

In [110]:
%%sql
UPDATE election2020
SET committee_key = committee.key
FROM committee
WHERE election2020.cmte_id = committee.cmte_id 
AND election2020.cmte_nm = committee.cmte_name
AND election2020.cont_name = committee.contributor_name
AND election2020.cmte_dsgn = committee.cmte_dsgn
AND election2020.entity_tp = committee.entity_type
AND election2020.ORG_TP =committee.ORG_TP;

 * postgresql://student@/final
144480 rows affected.

[]

#### * candidate_key

In [111]:
%%sql
ALTER TABLE election2020
ADD COLUMN candidate_key INTEGER,
ADD CONSTRAINT cd_fk FOREIGN KEY(candidate_key) REFERENCES candidate(key);

 * postgresql://student@/final
Done.

[]

In [112]:
%%sql
UPDATE election2020
SET candidate_key = candidate.key
FROM candidate
WHERE election2020.cand_id = candidate.cand_id
AND election2020.cand_name = candidate.cand_name
AND election2020.cand_pty_affiliation = candidate.cand_party
AND election2020.ttl_receipts = candidate.total_receipts
AND election2020.CAND_ELECTION_YR=candidate.CAND_ELECTION_YR
AND election2020.CAND_OFFICE=candidate.CAND_OFFICE
AND election2020.CAND_OFFICE_DISTRICT=candidate.CAND_OFFICE_DISTRICT
And election2020.CAND_PCC=candidate.CAND_PCC
AND election2020.CAND_PTY_AFFILIATION=candidate.CAND_PTY_AFFILIATION;

 * postgresql://student@/final
173884 rows affected.

[]

* distributed_key

In [113]:
%%sql
ALTER TABLE election2020
ADD COLUMN distributed_key INTEGER,
ADD CONSTRAINT ds_fk FOREIGN KEY(distributed_key) REFERENCES distributed(key);

 * postgresql://student@/final
Done.

[]

In [114]:
%%sql
UPDATE election2020
SET distributed_key = distributed.key
FROM distributed
WHERE election2020.COH_BOP = distributed.COH_BOP
AND election2020.COH_COP = distributed.COH_COP;

 * postgresql://student@/final
173885 rows affected.

[]

* loan and refund_key

In [115]:
%%sql
ALTER TABLE election2020
ADD COLUMN loan_key INTEGER,
ADD CONSTRAINT lr_fk FOREIGN KEY(loan_key) REFERENCES loan_refund(key);

 * postgresql://student@/final
Done.

[]

In [116]:
%%sql
UPDATE election2020
SET loan_key = loan_refund.key
FROM loan_refund
WHERE election2020.CAND_LOANS = loan_refund.CAND_LOANS
AND election2020.OTHER_LOANS = loan_refund.OTHER_LOANS
AND election2020.CAND_LOAN_REPAY = loan_refund.CAND_LOAN_REPAY
AND election2020.OTHER_LOAN_REPAY = loan_refund.OTHER_LOAN_REPAY
AND election2020.DEBTS_OWED_BY = loan_refund.DEBTS_OWED_BY;

 * postgresql://student@/final
173885 rows affected.

[]

### Drop the columns duplicated with the ones in each dimension table

In [117]:
%%sql
ALTER TABLE election2020
DROP COLUMN transaction_dt,
DROP COLUMN cmte_city,
DROP COLUMN cmte_st,
DROP COLUMN cmte_id,
DROP COLUMN cmte_nm,
DROP COLUMN cmte_dsgn,
DROP COLUMN entity_tp,
DROP COLUMN cont_name,
DROP COLUMN cand_id,
DROP COLUMN cand_name,
DROP COLUMN cand_pty_affiliation,
DROP COLUMN ttl_receipts,
DROP COLUMN COH_BOP,
DROP COLUMN COH_COP,
DROP COLUMN ORG_TP,
DROP COLUMN cand_loans,
DROP COLUMN other_loans,
DROP COLUMN cand_loan_repay,
DROP COLUMN other_loan_repay,
DROP COLUMN debts_owed_by,
DROP COLUMN cand_election_yr,
DROP COLUMN cand_office_st,
DROP COLUMN cand_office,
DROP COLUMN cand_office_district,
DROP COLUMN cand_pcc;

 * postgresql://student@/final
Done.

[]

In [118]:
%%sql
SELECT *
FROM election2020
LIMIT 5

 * postgresql://student@/final
5 rows affected.

[(Decimal('29500'), Decimal('1000.00'), Decimal('398892.99'), Decimal('10000.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), None, 9095, 15090, 1026, 725, 120),
 (Decimal('62300'), Decimal('1000.00'), Decimal('398892.99'), Decimal('10000.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), None, 9095, 45231, 1026, 725, 120),
 (Decimal('1575'), Decimal('1000.00'), Decimal('398892.99'), Decimal('10000.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), None, 9095, 14769, 1026, 725, 120),
 (Decimal('96000'), Decimal('1000.00'), Decimal('398892.99'), Decimal('10000.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), None, 9095, 45231, 1026, 725, 120),
 (Decimal('2730'), Decimal('1000.00'), Decimal('398892.99'), Decimal('10000.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), None, 9095, 14769, 1026, 725, 120)]

## -----------------Q & A-----------------

#### Q1(Seungheon Han): the results of the presidential elections in the US usually rely on decisions of toss-up states. In addition, the possibility of leaning states supporting the opponent party raises the tension of the elections. Therefore, it can be significant to explore the potential factors that enable us to predict which state will finally support which party. In this regard, the Q1 is expected to help us discern the influences of the amount of transactions between political committees and candidates on the final results in leaning and swing states.

## Q1: The total amount of transactions (the sum of absolute values) occurring between committees and candidates affiliated to either democratic or republican party by states in 2020

### Answer:

In [119]:
%%sql
SELECT lc.cmte_state, cd.cand_party, sum(abs(transaction_amt)) as total_transactions
FROM election2020 ta
INNER JOIN location lc
ON ta.location_key = lc.key
INNER JOIN committee cm
ON ta.committee_key = cm.key
INNER JOIN candidate cd
ON ta.candidate_key = cd.key
INNER JOIN date dt
ON ta.date_key = dt.key
WHERE dt.year IN ('2020') 
GROUP BY (lc.cmte_state , cd.cand_party)
HAVING cd.cand_party IN ('DEM', 'REP') AND lc.cmte_state IN ('MI', 'TX', 'OH', 'GA', 'AZ', 'WI', 'PA', 'NC', 'FL', 'IA', 'NV', 'CO','MN')
ORDER BY lc.cmte_state, cd.cand_party

 * postgresql://student@/final
26 rows affected.

[('AZ', 'DEM', Decimal('15000')),
 ('AZ', 'REP', Decimal('29500')),
 ('CO', 'DEM', Decimal('1500')),
 ('CO', 'REP', Decimal('5000')),
 ('FL', 'DEM', Decimal('7500')),
 ('FL', 'REP', Decimal('51000')),
 ('GA', 'DEM', Decimal('14000')),
 ('GA', 'REP', Decimal('39000')),
 ('IA', 'DEM', Decimal('27500')),
 ('IA', 'REP', Decimal('53000')),
 ('MI', 'DEM', Decimal('42500')),
 ('MI', 'REP', Decimal('14500')),
 ('MN', 'DEM', Decimal('1000')),
 ('MN', 'REP', Decimal('30298')),
 ('NC', 'DEM', Decimal('17500')),
 ('NC', 'REP', Decimal('25500')),
 ('NV', 'DEM', Decimal('2000')),
 ('NV', 'REP', Decimal('6500')),
 ('OH', 'DEM', Decimal('36000')),
 ('OH', 'REP', Decimal('36500')),
 ('PA', 'DEM', Decimal('83500')),
 ('PA', 'REP', Decimal('7500')),
 ('TX', 'DEM', Decimal('184000')),
 ('TX', 'REP', Decimal('249835')),
 ('WI', 'DEM', Decimal('8500')),
 ('WI', 'REP', Decimal('7500'))]

In [120]:
%%sql
SELECT * 
FROM(
    SELECT lc.cmte_state, cd.cand_party, sum(abs(transaction_amt)) as total_transactions 
    FROM election2020 ta
    INNER JOIN location lc
    ON ta.location_key = lc.key
    INNER JOIN committee cm
    ON ta.committee_key = cm.key
    INNER JOIN candidate cd
    ON ta.candidate_key = cd.key
    INNER JOIN date dt
    ON ta.date_key = dt.key
    WHERE dt.year = '2020' 
    GROUP BY (lc.cmte_state , cd.cand_party)
    HAVING cd.cand_party IN ('DEM', 'REP') AND lc.cmte_state IN ('MI', 'TX', 'OH', 'GA', 'AZ', 'WI', 'PA', 'NC', 'FL', 'IA', 'NV', 'CO','MN')
    ORDER BY lc.cmte_state, cd.cand_party) as tab
WHERE total_transactions IN (SELECT max(total_transactions) 
                             FROM (SELECT lc.cmte_state, cd.cand_party, sum(abs(transaction_amt)) as total_transactions 
                                   FROM election2020 ta
                                   INNER JOIN location lc
                                   ON ta.location_key = lc.key
                                   INNER JOIN committee cm
                                   ON ta.committee_key = cm.key
                                   INNER JOIN candidate cd
                                   ON ta.candidate_key = cd.key
                                   INNER JOIN date dt
                                   ON ta.date_key = dt.key
                                   WHERE dt.year = '2020'
                                   GROUP BY (lc.cmte_state , cd.cand_party) 
                                   HAVING cd.cand_party IN ('DEM', 'REP') AND lc.cmte_state IN ('MI', 'TX', 'OH', 'GA', 'AZ', 'WI', 'PA', 'NC', 'FL', 'IA', 'NV', 'CO', 'MN')) as tab2
                             GROUP BY cmte_state);

 * postgresql://student@/final
13 rows affected.

[('AZ', 'REP', Decimal('29500')),
 ('CO', 'REP', Decimal('5000')),
 ('FL', 'REP', Decimal('51000')),
 ('GA', 'REP', Decimal('39000')),
 ('IA', 'REP', Decimal('53000')),
 ('MI', 'DEM', Decimal('42500')),
 ('MN', 'REP', Decimal('30298')),
 ('NC', 'REP', Decimal('25500')),
 ('NV', 'REP', Decimal('6500')),
 ('OH', 'REP', Decimal('36500')),
 ('PA', 'DEM', Decimal('83500')),
 ('TX', 'REP', Decimal('249835')),
 ('WI', 'DEM', Decimal('8500'))]

#### * Electoral States (Forecaste & Result): these databases will be used for visualization

* forecaste map (source: CNN)

In [51]:
%%sql
DROP TABLE IF EXISTS forecast_map;

CREATE TABLE forecast_map(
states VARCHAR(2) UNIQUE NOT NULL,
support VARCHAR(7) NOT NULL
);

 * postgresql://student@/final
Done.
Done.

[]

In [52]:
%%sql
INSERT INTO forecast_map
VALUES
('AK', 'REP'),
('AL', 'REP'),
('AR', 'REP'),
('AZ', 'TOSSUP'),
('CA', 'DEM'),
('CO', 'LEANDEM'),
('CT', 'DEM'),
('DE', 'DEM'),
('DC', 'DEM'),
('FL', 'TOSSUP'),
('GA', 'TOSSUP'),
('HI', 'DEM'),
('IA', 'TOSSUP'),
('ID', 'REP'),
('IL', 'DEM'),
('IN', 'REP'),
('KS', 'REP'),
('KY', 'REP'),
('LA', 'REP'),
('MA', 'DEM'),
('MD', 'DEM'),
('ME', 'DEM'),
('MI', 'LEANDEM'),
('MN', 'LEANDEM'),
('MO', 'REP'),
('MS', 'REP'),
('MT', 'REP'),
('NC', 'TOSSUP'),
('ND', 'REP'),
('NE', 'REP'),
('NH', 'LEANDEM'),
('NJ', 'DEM'),
('NM', 'DEM'),
('NV', 'LEANDEM'),
('NY', 'DEM'),
('OH', 'TOSSUP'),
('OK', 'REP'),
('OR', 'DEM'),
('PA', 'LEANDEM'),
('RI', 'DEM'),
('SC', 'REP'),
('SD', 'REP'),
('TN', 'REP'),
('TX', 'LEANREP'),
('UT', 'REP'),
('VA', 'DEM'),
('VT', 'DEM'),
('WA', 'DEM'),
('WI', 'LEANDEM'),
('WV', 'REP'),
('WY', 'REP');

 * postgresql://student@/final
51 rows affected.

[]

* result map (source: CNN)

In [53]:
%%sql
DROP TABLE IF EXISTS result_map;

CREATE TABLE result_map(
states VARCHAR(2) UNIQUE NOT NULL,
support VARCHAR(7) NOT NULL
);

 * postgresql://student@/final
Done.
Done.

[]

In [54]:
%%sql
INSERT INTO result_map
VALUES
('AK', 'REP'),
('AL', 'REP'),
('AR', 'REP'),
('AZ', 'DEM'),
('CA', 'DEM'),
('CO', 'DEM'),
('CT', 'DEM'),
('DE', 'DEM'),
('DC', 'DEM'),
('FL', 'REP'),
('GA', 'DEM'),
('HI', 'DEM'),
('IA', 'REP'),
('ID', 'REP'),
('IL', 'DEM'),
('IN', 'REP'),
('KS', 'REP'),
('KY', 'REP'),
('LA', 'REP'),
('MA', 'DEM'),
('MD', 'DEM'),
('ME', 'DEM'),
('MI', 'DEM'),
('MN', 'DEM'),
('MO', 'REP'),
('MS', 'REP'),
('MT', 'REP'),
('NC', 'REP'),
('ND', 'REP'),
('NE', 'REP'),
('NH', 'DEM'),
('NJ', 'DEM'),
('NM', 'DEM'),
('NV', 'DEM'),
('NY', 'DEM'),
('OH', 'REP'),
('OK', 'REP'),
('OR', 'DEM'),
('PA', 'DEM'),
('RI', 'DEM'),
('SC', 'REP'),
('SD', 'REP'),
('TN', 'REP'),
('TX', 'REP'),
('UT', 'REP'),
('VA', 'DEM'),
('VT', 'DEM'),
('WA', 'DEM'),
('WI', 'DEM'),
('WV', 'REP'),
('WY', 'REP');

 * postgresql://student@/final
51 rows affected.

[]

#### * define database names for the resulting dataset to export them

In [55]:
%%sql
DROP VIEW IF EXISTS first_df;

CREATE VIEW first_df AS
SELECT lc.cmte_state, cd.cand_party, sum(abs(transaction_amt)) as total_transactions
FROM election2020 ta
INNER JOIN location lc
ON ta.location_key = lc.key
INNER JOIN committee cm
ON ta.committee_key = cm.key
INNER JOIN candidate cd
ON ta.candidate_key = cd.key
INNER JOIN date dt
ON ta.date_key = dt.key
WHERE dt.year IN ('2020') 
GROUP BY (lc.cmte_state , cd.cand_party)
HAVING cd.cand_party IN ('DEM', 'REP') AND lc.cmte_state IN  ('MI', 'TX', 'OH', 'GA', 'AZ', 'WI', 'PA', 'NC', 'FL', 'IA', 'NV', 'CO', 'MN')
ORDER BY lc.cmte_state, cd.cand_party;

 * postgresql://student@/final
Done.
Done.

[]

In [56]:
df1 = %sql SELECT * FROM first_df;

 * postgresql://student@/final
26 rows affected.

In [57]:
%%sql
DROP VIEW IF EXISTS second_df;

CREATE VIEW second_df AS
SELECT * 
FROM(
    SELECT lc.cmte_state, cd.cand_party, sum(abs(transaction_amt)) as total_transactions 
    FROM election2020 ta
    INNER JOIN location lc
    ON ta.location_key = lc.key
    INNER JOIN committee cm
    ON ta.committee_key = cm.key
    INNER JOIN candidate cd
    ON ta.candidate_key = cd.key
    INNER JOIN date dt
    ON ta.date_key = dt.key
    WHERE dt.year = '2020'
    GROUP BY (lc.cmte_state , cd.cand_party)
    HAVING cd.cand_party IN ('DEM', 'REP') AND lc.cmte_state IN  ('MI', 'TX', 'OH', 'GA', 'AZ', 'WI', 'PA', 'NC', 'FL', 'IA', 'NV', 'CO', 'MN')
    ORDER BY lc.cmte_state, cd.cand_party) as tab
WHERE total_transactions IN (SELECT max(total_transactions) 
                             FROM (SELECT lc.cmte_state, cd.cand_party, sum(abs(transaction_amt)) as total_transactions 
                                   FROM election2020 ta
                                   INNER JOIN location lc
                                   ON ta.location_key = lc.key
                                   INNER JOIN committee cm
                                   ON ta.committee_key = cm.key
                                   INNER JOIN candidate cd
                                   ON ta.candidate_key = cd.key
                                   INNER JOIN date dt
                                   ON ta.date_key = dt.key
                                   WHERE dt.year = '2020' 
                                   GROUP BY (lc.cmte_state , cd.cand_party)
                                   HAVING cd.cand_party IN ('DEM', 'REP') AND lc.cmte_state IN  ('MI', 'TX', 'OH', 'GA', 'AZ', 'WI', 'PA', 'NC', 'FL', 'IA', 'NV', 'CO', 'MN')) as tab2
                             GROUP BY cmte_state);

 * postgresql://student@/final
Done.
Done.

[]

In [58]:
df2 = %sql SELECT * FROM second_df;

 * postgresql://student@/final
13 rows affected.

* forecast_map

In [59]:
%%sql
DROP VIEW IF EXISTS forecast_df;

CREATE VIEW forecast_df AS
SELECT *
FROM forecast_map

 * postgresql://student@/final
Done.
Done.

[]

In [60]:
fore_df = %sql SELECT * FROM forecast_df;

 * postgresql://student@/final
51 rows affected.

* result_map

In [61]:
%%sql
DROP VIEW IF EXISTS result_df;

CREATE VIEW result_df AS
SELECT *
FROM result_map

 * postgresql://student@/final
Done.
Done.

[]

In [62]:
result_df = %sql SELECT * FROM result_df;

 * postgresql://student@/final
51 rows affected.

* result map for the only interesting states

In [63]:
%%sql
DROP VIEW IF EXISTS inter_df;

CREATE VIEW inter_df AS
SELECT *
FROM result_map
WHERE states IN  ('MI', 'TX', 'OH', 'GA', 'AZ', 'WI', 'PA', 'NC', 'FL', 'IA', 'NV', 'CO', 'MN')

 * postgresql://student@/final
Done.
Done.

[]

In [64]:
inter_df = %sql SELECT * FROM inter_df;

 * postgresql://student@/final
13 rows affected.

#### * Export the databases (For working on Tableau)

In [65]:
import pandas as pd

In [66]:
df1_pd = pd.DataFrame(df1, columns = ("states", "party", "total_transaction"))
df1_pd.to_csv('df1.csv')

In [67]:
df2_pd = pd.DataFrame(df2, columns = ("states", "party", "total_transaction"))
df2_pd.to_csv('df2.csv')

In [68]:
fore_pd = pd.DataFrame(fore_df, columns = ("states", "support"))
fore_pd.to_csv('fore_df.csv')

In [69]:
result_pd = pd.DataFrame(result_df, columns = ("states", "support"))
result_pd.to_csv('result_df.csv')

In [70]:
inter_pd = pd.DataFrame(inter_df, columns = ("states", "support"))
inter_pd.to_csv('inter_df.csv')

### * Visualization

### 1) the 2020 electoral college map published by CNN before ballot

In [135]:
from IPython.display import Image

In [66]:
Image(url="https://final6212.s3.amazonaws.com/visual_alex/fore.png")

### -> the skyblue and pink states represent the leans-democratic and leans-republican states respectively. Toss-up (swing) states are colored gray.

### 2) This shows which party made bigger amount of transactions with committies by states in 2020

In [67]:
Image(url="https://final6212.s3.amazonaws.com/visual_alex/transaction_map2.png")

### 3) The comparison between the final supporting parties predicted by the amount of transactions among committees and candidates and the actual results

In [68]:
Image(url="https://final6212.s3.amazonaws.com/visual_alex/comparison2.png")

### -> Despite the number of data lost during the table connection, a 62% (8/13) of the leaning and swing states are correctly predicted.

## Q2(weike):from our dataset, it will be interesting to look at transaction amount >0 VS transaction amount <0, we believe Transaction AMT>0 is good enough by count for each state and city, and we also want to know why there is a problem with which city and state has transaction amount less than 0.

In [121]:
%%sql
DROP TABLE IF EXISTS TM cascade;

CREATE TABLE TM AS
SELECT CMTE_CITY, cmte_state, sum(case when TRANSACTION_AMT > 0 then 1 else 0 end) as "Transaction_greater_than_zero", 
sum(case when TRANSACTION_AMT <0  then 1 else 0 end) as "Transaction_less_than_zero",
count(*) as "Total transaction"
FROM location
JOIN election2020
  ON location.key = election2020.location_key
Join date
  ON date.key = election2020.date_key
WHERE date.year IN ('2020')
GROUP BY  cmte_state, CMTE_CITY
;

 * postgresql://student@/final
Done.
197 rows affected.

[]

In [122]:
%%sql
SELECT *
FROM TM
LIMIT 10

 * postgresql://student@/final
10 rows affected.

[('TRACY', 'CA', 3, 0, 3),
 ('ESSEXVILLE', 'MI', 1, 0, 1),
 ('TAMPA', 'FL', 6, 0, 6),
 ('MONETA', 'VA', 3, 0, 3),
 ('ARLINGTON HEIGHTS', 'IL', 0, 2, 2),
 ('OMAHA', 'NE', 38, 0, 38),
 ('ORLANDO', 'FL', 1, 0, 1),
 ('NORTH BETHESDA', 'MD', 14, 0, 14),
 ('PITTSBURGH', 'PA', 20, 0, 20),
 ('GAITHERSBURG', 'MD', 6, 0, 6)]

#### * create a the dataframe and explore to tableau to visilization of dataset.

In [53]:
TM = %sql SELECT * FROM TM;

 * postgresql://student@/final
197 rows affected.

In [72]:
import pandas as pd

In [79]:
df = pd.DataFrame(TM, columns = ("cmte_city", "cmte_state", "Trsaction_greater than_zero","Transaction_less_than_zero","Total transaction"))
df.to_csv('df.csv')

### * visilization of the output

In [54]:
from IPython.display import Image

#### the total trasaction amount greater than >0, and show which state at which city people more willing to contribute to donate at election (year 2020)

In [55]:
Image(url = "https://final6212.s3.amazonaws.com/red.jpeg")

#### the total transaction amount is less than <0, and show at which state at which city people would like to spend thier money at election (year 2020)

In [75]:
Image(url = "https://final6212.s3.amazonaws.com/blue.jpeg")

#### * from our finding, the washington DC people would like to donate and spend the most of their to election, and people from TX houstn, Los CA also willing to spend most of their money contribute to the election2020. And from newport beach CA and Englewood cliffes chicago people will also make most expenditure at the election2020. so, that's would be interesting to look at from year to year how the city and state changed from donation and spend.

## Q3(weike): after we look at transaction amount. it would be interesting to look at which cmte design which types of orgnization has most cmte refund and what is their begining and end cashing balance.

In [123]:
%%sql
SELECT DISTINCT ORG_TP
FROM committee;

 * postgresql://student@/final
7 rows affected.

[(None,), ('V',), ('W',), ('C',), ('M',), ('T',), ('L',)]

In [124]:
%%sql
SELECT DISTINCT cmte_dsgn
FROM committee;

 * postgresql://student@/final
6 rows affected.

[('D',), ('A',), ('B',), ('J',), ('P',), ('U',)]

In [58]:
%%sql
DROP TABLE IF EXISTS refund cascade;

CREATE TABLE refund AS
SELECT cmte_dsgn, ORG_TP, COH_BOP, COH_COP
from election2020 ta
    INNER JOIN committee cm
    on ta.committee_key=cm.key
    INNER JOIN distributed ds
    on ta.distributed_key=ds.key
    INNER JOIN date dt
    ON ta.date_key = dt.key
    WHERE dt.year = '2020'
    GROUP BY cm.cmte_dsgn, cm.ORG_TP, ds.COH_BOP, ds.COH_COP
    ORDER BY ds.COH_COP

 * postgresql://student@/final
Done.
1281 rows affected.

[]

In [59]:
%%sql
SELECT *
FROM refund
LIMIT 10

 * postgresql://student@/final
10 rows affected.

[('U', 'W', Decimal('0.00'), Decimal('-954.19')),
 ('U', 'W', Decimal('0.00'), Decimal('0.00')),
 ('B', 'M', Decimal('0.00'), Decimal('1000.00')),
 ('U', 'C', Decimal('0.00'), Decimal('1000.00')),
 ('U', 'C', Decimal('34589.84'), Decimal('2424.14')),
 ('U', 'M', Decimal('405.00'), Decimal('2704.51')),
 ('U', 'M', Decimal('0.00'), Decimal('3532.12')),
 ('U', 'T', Decimal('0.00'), Decimal('4047.32')),
 ('B', 'T', Decimal('91518.55'), Decimal('4860.33')),
 ('B', 'C', Decimal('0.00'), Decimal('9083.23'))]

#### Let explore this dataset into csv and make some meaningful graph to show our result.

In [60]:
refund = %sql SELECT * FROM refund;

 * postgresql://student@/final
1281 rows affected.

In [81]:
import pandas as pd

In [89]:
refund= pd.DataFrame(refund, columns = ("cmte_dsgn", "org_tp", "coh_bop","coh_cop"))
refund.to_csv('refund.csv')

#### visilization about beging and ending cash to see which type of committee design has recived most of cash by comparing beginging to end cash balance. And also, for that commitee what kinds of organization belong to that committee.( use tableau)

In [61]:
Image(url = "https://final6212.s3.amazonaws.com/bars.jpeg")

#### from the image 5 we know that the most popular committee type will be Lobbyist/Registrant PAC and Unauthorized, and from those 2 types of cmt design, most of people in that cmet has a job belong to Corporation or Membership organization or Trade association.

## Q3：sub-question: after we obtain result from most popular committee type, we also curious about indi refund from which cand office receive most indi refund? and also how much total_receipt did their received for the election 2020?

In [126]:
%%sql
DROP TABLE IF EXISTS indi_refund cascade;

CREATE TABLE indi_refund AS
SELECT CAND_OFFICE, total_receipts, INDIV_REFUNDS
FROM candidate
JOIN election2020
  ON candidate.key = election2020.candidate_key
Join date
  ON date.key = election2020.date_key
WHERE date.year IN ('2020')
GROUP BY CAND_OFFICE, total_receipts, INDIV_REFUNDS
;

 * postgresql://student@/final
Done.
628 rows affected.

[]

In [127]:
%%sql
SELECT *
FROM indi_refund
LIMIT 10

 * postgresql://student@/final
10 rows affected.

[('H', Decimal('1789993.06'), Decimal('12462.00')),
 ('H', Decimal('2060353.24'), Decimal('27891.42')),
 ('H', Decimal('1091544.85'), Decimal('10143.00')),
 ('H', Decimal('2528405.58'), Decimal('34400.00')),
 ('H', Decimal('1933021.34'), Decimal('0.00')),
 ('H', Decimal('5615412.54'), Decimal('36253.40')),
 ('H', Decimal('599896.55'), Decimal('4300.00')),
 ('H', Decimal('1165084.58'), Decimal('8136.56')),
 ('H', Decimal('697951.45'), Decimal('9605.34')),
 ('H', Decimal('1850241.19'), Decimal('1000.00'))]

#### Let explore this dataset into csv and make some meaningful graph to show our result.

In [67]:
indi_refund = %sql SELECT * FROM indi_refund;

 * postgresql://student@/final
628 rows affected.

In [65]:
import pandas as pd

In [68]:
indi_refund= pd.DataFrame(indi_refund, columns = ("cand_office", "total_receipts","indiv_refunds" ))
indi_refund.to_csv('indi_refund.csv')

#### it will be interesting to look at H = House, P = President, S = Senate, which orgnation received most indi_refund and totaL_receipts, what is the average number of that, and also how many does their received.

In [69]:
Image(url = "https://final6212.s3.amazonaws.com/h_bar1.jpeg")

In [87]:
Image(url = "https://final6212.s3.amazonaws.com/h_bar2.jpeg")

In [88]:
Image(url = "https://final6212.s3.amazonaws.com/h_bar3.jpeg")

## Q4(Yiliang Xu): What is the total liabilities that candidates hold in 2020? How does it differ to 2016?

In [128]:
%%sql
SELECT cd.cand_name, lr.cand_loans, lr.other_loans, lr.debts_owed_by, ta.total_liabilities
    
FROM election2020 ta
INNER JOIN location lc
ON ta.location_key = lc.key
INNER JOIN candidate cd
ON ta.candidate_key = cd.key
INNER JOIN loan_refund lr
ON ta.loan_key = lr.key

GROUP BY (cd.cand_name, lr.cand_loans, lr.other_loans, lr.debts_owed_by, ta.total_liabilities)
ORDER BY ta.total_liabilities DESC
LIMIT 10;

 * postgresql://student@/final
10 rows affected.

[('LOEFFLER, KELLY', Decimal('23000000.00'), Decimal('0.00'), Decimal('23000000.00'), Decimal('46000000.00')),
 ('STEYER, TOM', Decimal('23811360.38'), Decimal('0.00'), Decimal('24000.00'), Decimal('23835360.38')),
 ('TRUMP, DONALD J.', Decimal('0.00'), Decimal('0.00'), Decimal('11339278.62'), Decimal('11339278.62')),
 ('HAGERTY, BILL', Decimal('0.00'), Decimal('7300000.00'), Decimal('3300000.00'), Decimal('10600000.00')),
 ('ASKAR, CASEY', Decimal('3200000.00'), Decimal('3300000.00'), Decimal('3362393.52'), Decimal('9862393.52')),
 ('HAMILTON, BOB', Decimal('3750000.00'), Decimal('0.00'), Decimal('3751150.00'), Decimal('7501150.00')),
 ("MESSNER, BRYANT 'CORKY' S.", Decimal('5935515.00'), Decimal('0.00'), Decimal('933491.76'), Decimal('6869006.76')),
 ('ISSA, DARRELL', Decimal('6050000.00'), Decimal('0.00'), Decimal('557326.51'), Decimal('6607326.51')),
 ('MCSALLY, MARTHA', Decimal('0.00'), Decimal('0.00'), Decimal('6290412.98'), Decimal('6290412.98')),
 ('MAURO, EDDIE J', Decimal('4545550.00'), Decimal('0.00'), Decimal('1620550.00'), Decimal('6166100.00'))]

#### * Export the databases (For working on Tableau)

In [71]:
%%sql
CREATE VIEW q3 AS
SELECT cd.cand_name, lr.cand_loans, lr.other_loans, lr.debts_owed_by, ta.total_liabilities
    
FROM election2020 ta
INNER JOIN candidate cd
ON ta.candidate_key = cd.key
INNER JOIN loan_refund lr
ON ta.loan_key = lr.key

GROUP BY (cd.cand_name, lr.cand_loans, lr.other_loans, lr.debts_owed_by, ta.total_liabilities)
ORDER BY ta.total_liabilities DESC
LIMIT 10;

 * postgresql://student@/final
Done.

[]

In [93]:
liabilities = %sql SELECT * FROM q3

 * postgresql://student@/final
10 rows affected.

In [102]:
import pandas as pd
liabilities = pd.DataFrame(liabilities, columns = ("Names", "Loans", "Other_loans", "Debts", "Total_amount"))
liabilities.to_csv("liabilities.csv")

* Using the same process, we can get the results of total liabilities that candidates hold in 2016. We will display these outcomes in visualization.

In [2]:
from IPython.display import Image

In [3]:
Image(url = "https://final6212.s3.amazonaws.com/Eloise_edit.jpeg")

In [73]:
Image(url = "https://final6212.s3.amazonaws.com/graph_2020.jpg")

## Q5(Ding): Compared with the contributions from party committees and other political committees for Biden and Trump and their party, what can you conclude?
 
### Sub-question: What’s the differences between the committee’s and individual contribution for Biden and Trump and their party?

#### First, we calculate the total Contributions from other political committees	by each person, it seem that Trump get much more contribution from other party committee than Biden, and REP candidates get more money than Rep.

In [129]:
%%sql
SELECT cd.cand_name, cd.cand_party, sum(other_pol_cmte_contrib) as total_otherscontri
FROM election2020 ta
INNER JOIN candidate cd
ON ta.candidate_key = cd.key
INNER JOIN date dt
ON ta.date_key = dt.key
WHERE dt.year IN ('2020') 
GROUP BY cd.cand_name, cd.cand_party
HAVING cd.cand_party IN ('DEM', 'REP') 
ORDER BY total_otherscontri DESC 
limit 11;

 * postgresql://student@/final
11 rows affected.

[('DAINES, STEVE', 'REP', Decimal('105974994.56')),
 ('TILLIS, THOM R. SEN.', 'REP', Decimal('80749489.97')),
 ('DAVIS, RODNEY L', 'REP', Decimal('80066930.72')),
 ('ERNST, JONI K', 'REP', Decimal('70763121.78')),
 ('PERDUE, DAVID', 'REP', Decimal('70427080.00')),
 ('PETERS, GARY', 'DEM', Decimal('67500609.44')),
 ('MCSALLY, MARTHA', 'REP', Decimal('57270339.42')),
 ('MCCONNELL, MITCH', 'REP', Decimal('50368465.98')),
 ('GRAHAM, LINDSEY O.', 'REP', Decimal('49154041.20')),
 ('COLLINS, SUSAN M.', 'REP', Decimal('42853062.12')),
 ('DEFAZIO, PETER A', 'DEM', Decimal('42671395.78'))]

In [75]:
%%sql
DROP VIEW IF EXISTS first_df;

CREATE VIEW first_df AS
SELECT cd.cand_name, cd.cand_party, sum(other_pol_cmte_contrib) as total_otherscontri
FROM election2020 ta
INNER JOIN candidate cd
ON ta.candidate_key = cd.key
INNER JOIN date dt
ON ta.date_key = dt.key
WHERE dt.year IN ('2020') 
GROUP BY cd.cand_name, cd.cand_party
HAVING cd.cand_party IN ('DEM', 'REP') 
ORDER BY total_otherscontri DESC

 * postgresql://student@/final
Done.
Done.

[]

In [100]:
df1 = %sql SELECT * FROM first_df;

 * postgresql://student@/final
617 rows affected.

In [ ]:
df1_pd = pd.DataFrame(df1, columns = ("cand_name", "cand_party", "total_otherscontri"))
df1_pd.to_csv('total_otherscontri.csv')

In [76]:
Image(url = "https://final6212.s3.amazonaws.com/Qunzhe1.jpeg")

#### First, we calculate the total Contributions from party committees, it seem that Trump get much more contribution from other party committee than Biden, and REP candidates get more money than Rep.

In [130]:
%%sql
SELECT cd.cand_name, cd.cand_party, sum(pol_pty_contrib) as total_contri
FROM election2020 ta
INNER JOIN candidate cd
ON ta.candidate_key = cd.key
INNER JOIN date dt
ON ta.date_key = dt.key
WHERE dt.year IN ('2020') 
GROUP BY cd.cand_name, cd.cand_party
HAVING cd.cand_party IN ('DEM', 'REP') 
ORDER BY total_contri DESC
limit 10;

 * postgresql://student@/final
10 rows affected.

[('TUBERVILLE, THOMAS H', 'REP', Decimal('1420500.00')),
 ('ERNST, JONI K', 'REP', Decimal('1192100.00')),
 ('GRAHAM, LINDSEY O.', 'REP', Decimal('1075200.00')),
 ('GREENFIELD, THERESA', 'DEM', Decimal('1054160.94')),
 ('MCSALLY, MARTHA', 'REP', Decimal('999222.00')),
 ('MARSHALL, ROGER W', 'REP', Decimal('997700.00')),
 ('COLLINS, SUSAN M.', 'REP', Decimal('852316.42')),
 ('LOEFFLER, KELLY', 'REP', Decimal('624400.00')),
 ('CUNNINGHAM, CAL', 'DEM', Decimal('546000.00')),
 ('CORNYN, JOHN SEN', 'REP', Decimal('541200.00'))]

In [131]:
%%sql
DROP VIEW IF EXISTS second_df;

CREATE VIEW second_df AS
SELECT cd.cand_name, cd.cand_party, sum(pol_pty_contrib) as total_contri
FROM election2020 ta
INNER JOIN candidate cd
ON ta.candidate_key = cd.key
INNER JOIN date dt
ON ta.date_key = dt.key
WHERE dt.year IN ('2020') 
GROUP BY cd.cand_name, cd.cand_party
HAVING cd.cand_party IN ('DEM', 'REP') 
ORDER BY total_contri DESC

 * postgresql://student@/final
Done.
Done.

[]

In [ ]:
df2 = %sql SELECT * FROM second_df;
df2_pd = pd.DataFrame(df2, columns = ("cand_name", "cand_party", "total_pol_pty_contrib"))
df2_pd.to_csv('total_pol_pty_contrib.csv')

In [105]:
Image(url = "https://final6212.s3.amazonaws.com/Qunzhe2.jpeg")

#### Then, we calculate the Total individual contributions for each candidate, it shows that Biden's individual contributions contribution is almost doubled than trump, but other REP candidate don't have a considerable more contribution than DEM.

In [132]:
%%sql
SELECT cd.cand_name, cd.cand_party, ta.ttl_indiv_contrib
FROM election2020 ta
INNER JOIN candidate cd
ON ta.candidate_key = cd.key
INNER JOIN date dt
ON ta.date_key = dt.key
WHERE dt.year IN ('2020') 
GROUP BY cd.cand_name, cd.cand_party, ta.ttl_indiv_contrib
ORDER BY ttl_indiv_contrib DESC
limit 10;

 * postgresql://student@/final
10 rows affected.

[('BIDEN, JOSEPH R JR', 'DEM', Decimal('719798548.30')),
 ('TRUMP, DONALD J.', 'REP', Decimal('316611498.80')),
 ('HARRISON, JAIME', 'DEM', Decimal('107645932.00')),
 ('KELLY, MARK', 'DEM', Decimal('97439121.43')),
 ('MCGRATH, AMY', 'DEM', Decimal('87931707.58')),
 ('MCSALLY, MARTHA', 'REP', Decimal('68332656.18')),
 ('GIDEON, SARA', 'DEM', Decimal('67402321.11')),
 ('GRAHAM, LINDSEY O.', 'REP', Decimal('65646689.23')),
 ('MCCONNELL, MITCH', 'REP', Decimal('55895508.09')),
 ('GREENFIELD, THERESA', 'DEM', Decimal('52970099.34'))]

In [133]:
%%sql
DROP VIEW IF EXISTS last_df;

CREATE VIEW last_df AS
SELECT cd.cand_name, cd.cand_party, ta.ttl_indiv_contrib
FROM election2020 ta
INNER JOIN candidate cd
ON ta.candidate_key = cd.key
INNER JOIN date dt
ON ta.date_key = dt.key
WHERE dt.year IN ('2020') 
GROUP BY cd.cand_name, cd.cand_party, ta.ttl_indiv_contrib
ORDER BY ttl_indiv_contrib DESC

 * postgresql://student@/final
Done.
Done.

[]

In [108]:
df3 = %sql SELECT * FROM last_df;
df3_pd = pd.DataFrame(df3, columns = ("cand_name", "cand_party", "ttl_indiv_contrib"))
df3_pd.to_csv('totalindiv.csv')

 * postgresql://student@/final
628 rows affected.

In [109]:
Image(url = "https://final6212.s3.amazonaws.com/Qunzhe3.jpeg")

In [110]:
Image(url = "https://final6212.s3.amazonaws.com/Qunzhe4.jpeg")